---
kind: method
id: M:Autodesk.Revit.DB.ModelText.GetVisibility
source: html/3695dbc9-9f39-d2a7-a11d-cec70a16313a.htm
---
# Autodesk.Revit.DB.ModelText.GetVisibility Method

Gets the visibility for the model text in a family document.

## Syntax (C#)
```csharp
public FamilyElementVisibility GetVisibility()
```

## Returns
A copy of visibility settings for the model text in a family document.